tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32625/Include/ioman_regs.h
/*******************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2016-04-26 09:58:10 -0500 (Tue, 26 Apr 2016) $
 * $Revision: 22519 $
 *
 ******************************************************************************/

#ifndef _MXC_IOMAN_REGS_H_
#define _MXC_IOMAN_REGS_H_

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif


/*
    Bitfield structs for registers in this module
*/

typedef struct {
    uint32_t wud_req_p0 : 8;
    uint32_t wud_req_p1 : 8;
    uint32_t wud_req_p2 : 8;
    uint32_t wud_req_p3 : 8;
} mxc_ioman_wud_req0_t;

typedef struct {
    uint32_t wud_req_p4 : 8;
    uint32_t            : 24;
} mxc_ioman_wud_req1_t;

typedef struct {
    uint32_t wud_ack_p0 : 8;
    uint32_t wud_ack_p1 : 8;
    uint32_t wud_ack_p2 : 8;
    uint32_t wud_ack_p3 : 8;
} mxc_ioman_wud_ack0_t;

typedef struct {
    uint32_t wud_ack_p4 : 8;
    uint32_t            : 24;
} mxc_ioman_wud_ack1_t;

typedef struct {
    uint32_t ali_req_p0 : 8;
    uint32_t ali_req_p1 : 8;
    uint32_t ali_req_p2 : 8;
    uint32_t ali_req_p3 : 8;
} mxc_ioman_ali_req0_t;

typedef struct {
    uint32_t ali_req_p4 : 8;
    uint32_t            : 24;
} mxc_ioman_ali_req1_t;

typedef struct {
    uint32_t ali_ack_p0 : 8;
    uint32_t ali_ack_p1 : 8;
    uint32_t ali_ack_p2 : 8;
    uint32_t ali_ack_p3 : 8;
} mxc_ioman_ali_ack0_t;

typedef struct {
    uint32_t ali_ack_p4 : 8;
    uint32_t            : 24;
} mxc_ioman_ali_ack1_t;

typedef struct {
    uint32_t             : 4;
    uint32_t core_io_req : 1;
    uint32_t             : 3;
    uint32_t ss0_io_req  : 1;
    uint32_t ss1_io_req  : 1;
    uint32_t ss2_io_req  : 1;
    uint32_t             : 1;
    uint32_t quad_io_req : 1;
    uint32_t             : 3;
    uint32_t fast_mode   : 1;
    uint32_t             : 15;
} mxc_ioman_spix_req_t;

typedef struct {
    uint32_t             : 4;
    uint32_t core_io_ack : 1;
    uint32_t             : 3;
    uint32_t ss0_io_ack  : 1;
    uint32_t ss1_io_ack  : 1;
    uint32_t ss2_io_ack  : 1;
    uint32_t             : 1;
    uint32_t quad_io_ack : 1;
    uint32_t             : 3;
    uint32_t fast_mode   : 1;
    uint32_t             : 15;
} mxc_ioman_spix_ack_t;

typedef struct {
    uint32_t io_map     : 1;
    uint32_t cts_map    : 1;
    uint32_t rts_map    : 1;
    uint32_t            : 1;
    uint32_t io_req     : 1;
    uint32_t cts_io_req : 1;
    uint32_t rts_io_req : 1;
    uint32_t            : 25;
} mxc_ioman_uart0_req_t;

typedef struct {
    uint32_t io_map     : 1;
    uint32_t cts_map    : 1;
    uint32_t rts_map    : 1;
    uint32_t            : 1;
    uint32_t io_ack     : 1;
    uint32_t cts_io_ack : 1;
    uint32_t rts_io_ack : 1;
    uint32_t            : 25;
} mxc_ioman_uart0_ack_t;

typedef struct {
    uint32_t io_map     : 1;
    uint32_t cts_map    : 1;
    uint32_t rts_map    : 1;
    uint32_t            : 1;
    uint32_t io_req     : 1;
    uint32_t cts_io_req : 1;
    uint32_t rts_io_req : 1;
    uint32_t            : 25;
} mxc_ioman_uart1_req_t;

typedef struct {
    uint32_t io_map     : 1;
    uint32_t cts_map    : 1;
    uint32_t rts_map    : 1;
    uint32_t            : 1;
    uint32_t io_ack     : 1;
    uint32_t cts_io_ack : 1;
    uint32_t rts_io_ack : 1;
    uint32_t            : 25;
} mxc_ioman_uart1_ack_t;

typedef struct {
    uint32_t io_map     : 1;
    uint32_t cts_map    : 1;
    uint32_t rts_map    : 1;
    uint32_t            : 1;
    uint32_t io_req     : 1;
    uint32_t cts_io_req : 1;
    uint32_t rts_io_req : 1;
    uint32_t            : 25;
} mxc_ioman_uart2_req_t;

typedef struct {
    uint32_t io_map     : 1;
    uint32_t cts_map    : 1;
    uint32_t rts_map    : 1;
    uint32_t            : 1;
    uint32_t io_ack     : 1;
    uint32_t cts_io_ack : 1;
    uint32_t rts_io_ack : 1;
    uint32_t            : 25;
} mxc_ioman_uart2_ack_t;

typedef struct {
    uint32_t               : 4;
    uint32_t mapping_req   : 1;
	uint32_t scl_push_pull : 1;
    uint32_t               : 26;
} mxc_ioman_i2cm0_req_t;

typedef struct {
    uint32_t               : 4;
    uint32_t mapping_ack   : 1;
    uint32_t               : 27;
} mxc_ioman_i2cm0_ack_t;

