tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32625/Include/ioman_regs.h
typedef struct {
    uint32_t               : 4;
    uint32_t mapping_req   : 1;
	uint32_t scl_push_pull : 1;
    uint32_t               : 26;
} mxc_ioman_i2cm1_req_t;

typedef struct {
    uint32_t               : 4;
    uint32_t mapping_ack   : 1;
    uint32_t               : 27;
} mxc_ioman_i2cm1_ack_t;

typedef struct {
    uint32_t io_sel      : 2;
    uint32_t             : 2;
    uint32_t mapping_req : 1;
    uint32_t             : 27;
} mxc_ioman_i2cs_req_t;

typedef struct {
    uint32_t io_sel      : 2;
    uint32_t             : 2;
    uint32_t mapping_ack : 1;
    uint32_t             : 27;
} mxc_ioman_i2cs_ack_t;

typedef struct {
    uint32_t             : 4;
    uint32_t core_io_req : 1;
    uint32_t             : 3;
    uint32_t ss0_io_req  : 1;
    uint32_t ss1_io_req  : 1;
    uint32_t ss2_io_req  : 1;
    uint32_t ss3_io_req  : 1;
    uint32_t ss4_io_req  : 1;
    uint32_t             : 7;
    uint32_t quad_io_req : 1;
    uint32_t             : 3;
    uint32_t fast_mode   : 1;
    uint32_t             : 7;
} mxc_ioman_spim0_req_t;

typedef struct {
    uint32_t             : 4;
    uint32_t core_io_ack : 1;
    uint32_t             : 3;
    uint32_t ss0_io_ack  : 1;
    uint32_t ss1_io_ack  : 1;
    uint32_t ss2_io_ack  : 1;
    uint32_t ss3_io_ack  : 1;
    uint32_t ss4_io_ack  : 1;
    uint32_t             : 7;
    uint32_t quad_io_ack : 1;
    uint32_t             : 3;
    uint32_t fast_mode   : 1;
    uint32_t             : 7;
} mxc_ioman_spim0_ack_t;

typedef struct {
    uint32_t             : 4;
    uint32_t core_io_req : 1;
    uint32_t             : 3;
    uint32_t ss0_io_req  : 1;
    uint32_t ss1_io_req  : 1;
    uint32_t ss2_io_req  : 1;
    uint32_t             : 9;
    uint32_t quad_io_req : 1;
    uint32_t             : 3;
    uint32_t fast_mode   : 1;
    uint32_t             : 7;
} mxc_ioman_spim1_req_t;

typedef struct {
    uint32_t             : 4;
    uint32_t core_io_ack : 1;
    uint32_t             : 3;
    uint32_t ss0_io_ack  : 1;
    uint32_t ss1_io_ack  : 1;
    uint32_t ss2_io_ack  : 1;
    uint32_t             : 9;
    uint32_t quad_io_ack : 1;
    uint32_t             : 3;
    uint32_t fast_mode   : 1;
    uint32_t             : 7;
} mxc_ioman_spim1_ack_t;

typedef struct {
    uint32_t mapping_req : 1;
    uint32_t             : 3;
    uint32_t core_io_req : 1;
    uint32_t             : 3;
    uint32_t ss0_io_req  : 1;
    uint32_t ss1_io_req  : 1;
    uint32_t ss2_io_req  : 1;
    uint32_t             : 5;
    uint32_t sr0_io_req  : 1;
    uint32_t sr1_io_req  : 1;
    uint32_t             : 6;
    uint32_t fast_mode   : 1;
    uint32_t             : 7;
} mxc_ioman_spim2_req_t;

typedef struct {
    uint32_t mapping_ack : 1;
    uint32_t             : 3;
    uint32_t core_io_ack : 1;
    uint32_t             : 3;
    uint32_t ss0_io_ack  : 1;
    uint32_t ss1_io_ack  : 1;
    uint32_t ss2_io_ack  : 1;
    uint32_t             : 5;
    uint32_t sr0_io_req  : 1;
    uint32_t sr1_io_req  : 1;
    uint32_t             : 6;
    uint32_t fast_mode   : 1;
    uint32_t             : 7;
} mxc_ioman_spim2_ack_t;

typedef struct {
    uint32_t             : 4;
    uint32_t mapping_req : 1;
    uint32_t epu_io_req  : 1;
    uint32_t             : 26;
} mxc_ioman_owm_req_t;

typedef struct {
    uint32_t             : 4;
    uint32_t mapping_ack : 1;
    uint32_t epu_io_ack  : 1;
    uint32_t             : 26;
} mxc_ioman_owm_ack_t;

typedef struct {
    uint32_t             : 4;
    uint32_t core_io_req : 1;
    uint32_t             : 3;
    uint32_t quad_io_req : 1;
    uint32_t             : 3;
    uint32_t fast_mode   : 1;
    uint32_t             : 19;
} mxc_ioman_spis_req_t;

typedef struct {
    uint32_t             : 4;
    uint32_t core_io_ack : 1;
    uint32_t             : 3;
    uint32_t quad_io_ack : 1;
    uint32_t             : 3;
    uint32_t fast_mode   : 1;
    uint32_t             : 19;
} mxc_ioman_spis_ack_t;

typedef struct {
    uint32_t slow_mode     : 1;
    uint32_t alt_rcvr_mode : 1;
    uint32_t               : 30;
} mxc_ioman_pad_mode_t;


/*
   Typedefed structure(s) for module registers (per instance or section) with direct 32-bit
   access to each register in module.
*/

/*                                                          Offset          Register Description
                                                            =============   ============================================================================ */
typedef struct {
    __IO uint32_t wud_req0;                             /*  0x0000          Wakeup Detect Mode Request Register 0 (P0/P1/P2/P3)                          */
    __IO uint32_t wud_req1;                             /*  0x0004          Wakeup Detect Mode Request Register 1 (P4)                                   */
    __IO uint32_t wud_ack0;                             /*  0x0008          Wakeup Detect Mode Acknowledge Register 0 (P0/P1/P2/P3)                      */
    __IO uint32_t wud_ack1;                             /*  0x000C          Wakeup Detect Mode Acknowledge Register 1 (P4)                               */
    __IO uint32_t ali_req0;                             /*  0x0010          Analog Input Request Register 0 (P0/P1/P2/P3)                                */
    __IO uint32_t ali_req1;                             /*  0x0014          Analog Input Request Register 1 (P4)                                         */
    __IO uint32_t ali_ack0;                             /*  0x0018          Analog Input Acknowledge Register 0 (P0/P1/P2/P3)                            */
    __IO uint32_t ali_ack1;                             /*  0x001C          Analog Input Acknowledge Register 1 (P4)                                     */
    __IO uint32_t ali_connect0;                         /*  0x0020          Analog I/O Connection Control Register 0                                     */
    __IO uint32_t ali_connect1;                         /*  0x0024          Analog I/O Connection Control Register 1                                     */
    __IO uint32_t spix_req;                             /*  0x0028          SPIX I/O Mode Request                                                        */
    __IO uint32_t spix_ack;                             /*  0x002C          SPIX I/O Mode Acknowledge                                                    */
    __IO uint32_t uart0_req;                            /*  0x0030          UART0 I/O Mode Request                                                       */
    __IO uint32_t uart0_ack;                            /*  0x0034          UART0 I/O Mode Acknowledge                                                   */
    __IO uint32_t uart1_req;                            /*  0x0038          UART1 I/O Mode Request                                                       */
    __IO uint32_t uart1_ack;                            /*  0x003C          UART1 I/O Mode Acknowledge                                                   */
    __IO uint32_t uart2_req;                            /*  0x0040          UART2 I/O Mode Request                                                       */
    __IO uint32_t uart2_ack;                            /*  0x0044          UART2 I/O Mode Acknowledge                                                   */
    __R  uint32_t rsv048[2];                            /*  0x0048-0x004C                                                                                */
    __IO uint32_t i2cm0_req;                            /*  0x0050          I2C Master 0 I/O Request                                                     */
    __IO uint32_t i2cm0_ack;                            /*  0x0054          I2C Master 0 I/O Acknowledge                                                 */
    __IO uint32_t i2cm1_req;                            /*  0x0058          I2C Master 1 I/O Request                                                     */
    __IO uint32_t i2cm1_ack;                            /*  0x005C          I2C Master 1 I/O Acknowledge                                                 */
    __R  uint32_t rsv060[2];                            /*  0x0060-0x0064                                                                                */
    __IO uint32_t i2cs_req;                             /*  0x0068          I2C Slave I/O Request                                                        */
    __IO uint32_t i2cs_ack;                             /*  0x006C          I2C Slave I/O Acknowledge                                                    */
    __IO uint32_t spim0_req;                            /*  0x0070          SPI Master 0 I/O Mode Request                                                */
    __IO uint32_t spim0_ack;                            /*  0x0074          SPI Master 0 I/O Mode Acknowledge                                            */
    __IO uint32_t spim1_req;                            /*  0x0078          SPI Master 1 I/O Mode Request                                                */
    __IO uint32_t spim1_ack;                            /*  0x007C          SPI Master 1 I/O Mode Acknowledge                                            */
    __IO uint32_t spim2_req;                            /*  0x0080          SPI Master 2 I/O Mode Request                                                */
    __IO uint32_t spim2_ack;                            /*  0x0084          SPI Master 2 I/O Mode Acknowledge                                            */
    __R  uint32_t rsv088[2];                            /*  0x0088-0x008C                                                                                */
    __IO uint32_t owm_req;                              /*  0x0090          1-Wire Master I/O Mode Request                                               */
    __IO uint32_t owm_ack;                              /*  0x0094          1-Wire Master I/O Mode Acknowledge                                           */
    __IO uint32_t spis_req;                             /*  0x0098          SPI Slave I/O Mode Request                                                   */
    __IO uint32_t spis_ack;                             /*  0x009C          SPI Slave I/O Mode Acknowledge                                               */
    __R  uint32_t rsv0A0[24];                           /*  0x00A0-0x00FC                                                                                */
    __IO uint32_t use_vddioh_0;                         /*  0x0100          Enable VDDIOH Register 0                                                     */
    __IO uint32_t use_vddioh_1;                         /*  0x0104          Enable VDDIOH Register 1                                                     */
    __R  uint32_t rsv108[2];                            /*  0x0108-0x010C                                                                                */
    __IO uint32_t pad_mode;                             /*  0x0110          Pad Mode Control Register                                                    */
} mxc_ioman_regs_t;


